Интенсивное_обучение_программированию/src/InformationRegisters/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Файлы</name>
  <resources>
    <name>ДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Интенсивное_обучение_программированию/src/InformationRegisters/Файлы/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьФайлВБазу(ОбъектЗаписи, ДанныеФайла, РасширениеФайла, РазмерФайла) Экспорт
	
	АлгоритмСжатия 		= Новый СжатиеДанных(9);
	ХранилищеСФайлом 	= Новый ХранилищеЗначения(ДанныеФайла, АлгоритмСжатия);
	
	ЗаписьФайла 			= СоздатьМенеджерЗаписи();
	ЗаписьФайла.Объект 		= ОбъектЗаписи;
	ЗаписьФайла.ДанныеФайла = ХранилищеСФайлом;
	ЗаписьФайла.Расширение 	= РасширениеФайла;
	ЗаписьФайла.РазмерФайла = РазмерФайла;
	
	ЗаписьФайла.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьДанныеФайла(ОбъектЧтение) Экспорт

	ЧтениеФайла 		= СоздатьМенеджерЗаписи();
	ЧтениеФайла.Объект 	= ОбъектЧтение;	
	ЧтениеФайла.Прочитать();    
	
	ДанныеФайла = ЧтениеФайла.ДанныеФайла.Получить();
	
	Возврат ДанныеФайла;

КонецФункции 

#КонецОбласти
